# Розрахувати надбавку до зарплати за стаж: якщо стаж становить від 2 до 5 років,
# надбавка дорівнює 2%; якщо стаж становить від 5 до 10 років — 5%.
# Ввести з клавіатури зарплату та стаж, вивести надбавку та суму до виплати.
from os import name

# def count_bonus(stage: float, salary: float) -> float:
#     if stage < 2:
#         return "Try to work carefuly"
#     if stage >= 2 and stage <= 5:
#         return (salary * 0.02) + salary
#     elif stage > 5 and stage <= 10:
#         return (salary * 0.05) + salary
#     else:
#         return "Wow, you are antique, it's time to change your job!!!"
#
#
# salary = float(input("Enter your salary: "))
# stage = float(input("Enter your stage: "))
# print(count_bonus(stage, salary))

####################################################################

# 1 Даны два целых числа A и B (A < B).Найти все целые числа, расположенные
# между данными числами(включая сами эти числа), в порядке
# их возрастания, а также количество N этих чисел.


# a, b = 3, 9
# res = list()
# def found_number(a:int,b:int):
#     for i in range(a, b+1):
#         res.append(i)
#     print(res)
#     print("len -", len(res))
#
#
# found_number(a,b)


# 2 Даны два целых числа A и B(A < B).Найти все целые
# числа, расположенные между данными числами(не включая сами эти числа), в
# порядке их убывания, а также количество N этих чисел.

# a = 3
# b = 9
# res = list()
# def found_number(a:int,b:int):
#     for i in range(a-1, b):
#         res.append(i)
#         res.reverse()
#     print(res)
#     print("len -", len(res))
#
#
# found_number(a,b)


########################################################################################
# === ЗАДАЧІ НА СПИСКИ (LIST) ===
#
# 1. Унікальні гості
# Умова: Створи список із імен гостей, які прийшли на вечірку (деякі імена можуть повторюватися).
# Додай до кінця списку ще одне ім'я новоприбулого гостя та виведи загальну кількість елементів.
# Підказка: Використовуй метод .append() для додавання елемента та функцію len() для підрахунку.

# guests = ['Alice', 'Bob', 'Charlie', 'David', 'Bob']
# guests.append('Tereza')
# print(guests)
# print(len(guests))

# 2. Топ-3 геймера
# Умова: Є список оцінок або балів гравців: [45, 82, 12, 95, 67, 88]. Знайди та виведи три найвищі результати.
# Підказка: Спочатку відсортуй список за спаданням за допомогою .sort(reverse=True) або функції sorted(),
# а потім візьми зріз [:3].

# balls = [45, 82, 12, 95, 67, 88]
# balls.sort(reverse=True)
# # balls = balls[::-1]   # variant 2
# # new_data = sorted(balls, reverse=True)     # variant 3
# print(balls)
# # print(new_data)
# print(balls[:3])

# 3. Видалення невдахи
# Умова: Маємо список куплених продуктів. Виявилося, що один товар додали помилково (наприклад, "молоко").
# Видали цей конкретний товар зі списку за його назвою.
# Підказка: Для видалення елемента за його значенням ідеально підійде метод .remove("назва_товару").

# groceries = ['milk', 'apple', 'orange', 'banana']
# print(groceries)
# groceries.remove('milk')
# print(groceries)

# 4. Черга у магазині
# Умова: Є список людей у черзі. Перша людина забирає замовлення і йде. Видали першого покупця зі
# списку та виведи його ім'я на екран, а також покажи, хто залишився.
# Підказка: Метод .pop(0) не просто видаляє елемент за індексом 0, але й повертає його значення.

# queue = ['Alice', 'Bob', 'Charlie', 'David', 'Bob']
# print(queue)
# print(queue.pop(0))
# print(queue)

# 5. Переверни світ
# Умова: Створи список із назв днів тижня від понеділка до п'ятниці. Зроби так, щоб вони йшли у
# зворотному порядку (від п'ятниці до понеділка).
# Підказка: Можна використати метод списку .reverse() або зробити це за допомогою зрізу [::-1].

# name_day = ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday']
# print(name_day)
# #name_day.reverse()
# name_day = name_day[::-1]
# print(name_day)

#########################################################################################
# === ЗАДАЧІ НА КОРТЕЖІ (TUPLE) ===
# 1. Координати точки
# Умова: Створи кортеж, який зберігає координати об'єкта на карті (широту та довготу).
# Спробуй змінити перше значення. Оброби помилку або переконайся, що Python цього не дозволить.
# Підказка: Кортежі незмінні (immutable). Щоб "змінити" його, доведеться створити новий кортеж
# або просто вивести старий через print().

# cordinats = (123, 654)
# print(cordinats)
# new_cordinats = list(cordinats)
# print(new_cordinats)
# new_cordinats[0] = 888
# print(tuple(new_cordinats))

# 2. Розпакування багажу
# Умова: Є кортеж із трьох елементів, що описує товар: ("Ноутбук", 25000, "В наявності").
# Розпакуй ці значення в три окремі змінні (name, price, status) і виведи кожну з них.
# Підказка: Використовуй множинне присвоювання: name, price, status = мій_кортеж.

# item = ("Ноутбук", 25000, "В наявності")
# print(item)
# name, price, quantity = item
# print(name, price, quantity, sep=' || ')

# 3. Перевірка наявності
# Умова: Створи кортеж із п'яти різних кольорів. Напиши перевірку, яка з'ясовує, чи є колір "зелений"
# у цьому кортежі, і виводить "Так" або "Ні".
# Підказка: Використовуй оператор умови if та ключове слово in для перевірки наявності елемента.

# colors = ('red', 'green', 'blue', 'orange', 'yellow', 'cyan')
# print(colors)
# if 'green' in colors:
#     print('Yes')
# else:
#     print('No')

# 4. Пошук близнюків
# Умова: Дано кортеж із числами, де деякі значення повторюються, наприклад: (1, 2, 3, 2, 4, 2, 5).
# Порахуй, скільки разів цифра 2 зустрічається в цьому кортежі.
# Підказка: У кортежів є вбудований метод .count(значення), який рахує повторення.

# numbers = (1, 2, 3, 2, 4, 2, 5)
# print(numbers.count(2))

# 5. Злиття компаній
# Умова: Маємо два окремі кортежі з іменами співробітників двох різних відділів.
# Об'єднай їх в один великий кортеж, що представляє всю компанію.
# Підказка: Кортежі можна додавати один до одного за допомогою звичайного оператора плюс +.

# department_1 = ('Alice', 'Bob', 'Charlie', 'David', 'Bob')
# department_2 = ('Robin', 'Bob', 'Charlie', 'Bobin', 'Bob')
# print(department_1)
# print(department_2)
# total_department = department_1 + department_2
# print(total_department)

# === ЗАДАЧІ НА МНОЖИНИ (SET) ===
#
# 1. Фільтр дублікатів
# Умова: Очисти список [1, 2, 2, 3, 4, 4, 4, 5] від повторюваних елементів, щоб залишилися тільки унікальні числа.
# Підказка: Передай цей список у функцію set(). Множини автоматично видаляють усі дублікати.

# my_list = [1, 2, 2, 3, 4, 4, 4, 5]
# print(my_list)
# my_new_set = set(my_list)
# print(my_new_set)

# 2. Клуб любителів книг
# Умова: Є дві множини студентів: ті, хто прочитав першу книгу, і ті, хто прочитав другу.
# Знайди тих студентів, які прочитали обидві книги.
# Підказка: Для пошуку спільних елементів використовуй оператор амперсанд & або метод .intersection().


# read_book_1 = {'Alice', 'Bob', 'Charlie', 'David', 'Bob'}
# read_book_2 = {'Robin', 'Bob', 'Charlie', 'Bob', 'Bob'}
# print(read_book_1, '-->', len(read_book_1))
# print(read_book_2, '-->', len(read_book_2))
#
# excelent_students = read_book_1.intersection(read_book_2)
# print(excelent_students)


# 3. Спільні інтереси друзів
# Умова: Маємо список хобі Олега та список хобі Анни. Знайди повний перелік усіх унікальних хобі,
# якими захоплюються вони разом (без повторів).
# Підказка: Об'єднати дві множини в одну спільну можна за допомогою оператора вертикальної
# иски | або методу .union().

# oleg = {'swimming', 'chess', 'reading', 'music', 'gym', 'gym', 'gym'}
# anna = {'swimming', 'dancing', 'reading', 'music', 'gymnastic'}
# print(oleg, '-->', len(oleg))
# print(anna, '-->', len(anna))
# all_hobby = anna.union(oleg)
# print(all_hobby, '-->', len(all_hobby))

# 4. Хто не прийшов?
# Умова: Є множина всіх студентів групи та множина тих, хто сьогодні прийшов на пару.
# Знайди тих, хто прогуляв (тобто є в першій множині, але відсутній у другій).
# Підказка: Використовуй оператор мінус - або метод .difference(), щоб дізнатися різницю між множинами.

# all_group = {'Alice', 'Bob', 'Charlie', 'David', 'Robin', 'Cristofer', 'Emma', 'Frank', 'John', 'Michael'}
# in_class = {'Robin', 'Bob', 'Charlie', 'Bob', 'Emma'}
# print(all_group, '-->', len(all_group))
# print(in_class, '-->', len(in_class))
# down_student = all_group.difference(in_class)
# print(down_student, '-->', len(down_student))


#5. Забудь старе
# Умова: Створи множину зі своїх поточних завдань на день. Одне завдання ти вже виконав.
# Видали його з множини так, щоб програма не видавала помилку, навіть якщо цього завдання там раптом не виявиться.
# Підказка: Метод .remove() викличе помилку KeyError, якщо елемента немає.
# Тому краще безпечно використовувати метод .discard(елемент).

# my_to_do_list = {'swimming', 'chess',  'work', 'music', 'gym', 'reading'}
# print(my_to_do_list)
# # try:
# #     my_to_do_list.remove('sleeping')
# #     print(my_to_do_list)  # KeyError: 'sleeping'
# # except KeyError as e:
# #     print("Такого не заплановано - ", e)
#
# ############################ variant 2
#
# my_to_do_list.discard('sleeping')
# print(my_to_do_list)  # ignor error !!!




